In [1]:
import json

In [3]:
import json
my_list = ['a', 'b', 'c']
my_json_string = json.dumps(my_list)

In [4]:
my_json_string

'["a", "b", "c"]'

In [5]:
print(type(my_json_string))

<class 'str'>

In [9]:
import csv  
import json  
  
# Open the CSV  
f = open( 'check_data.csv', 'r' )  
# Change each fieldname to the appropriate field name. I know, so difficult.  
reader = csv.DictReader( f, fieldnames = ( "fieldname0","fieldname1","fieldname2","fieldname3" ))  
# Parse the CSV into JSON  
out = json.dumps( [ row for row in reader ] )  
print("JSON parsed!")

JSON parsed!

In [10]:
out

'[{"fieldname0": "\\u00ef\\u00bb\\u00bfName", "fieldname1": "id", "fieldname2": "marks", "fieldname3": "address"}, {"fieldname0": "Satish", "fieldname1": "34", "fieldname2": "84", "fieldname3": "vimal sadan"}, {"fieldname0": "Shivam", "fieldname1": "56", "fieldname2": "93", "fieldname3": "vimal sadan"}, {"fieldname0": "shubham", "fieldname1": "85", "fieldname2": "3", "fieldname3": "vimal sadan"}, {"fieldname0": "satyendra", "fieldname1": "85", "fieldname2": "58", "fieldname3": "sanskar sadan"}]'

In [11]:
d = {"a": [1, 2, 3], "b": ['satish', 'shivam', 'shubham'], "c": [4, 55, 34]}

In [12]:
a = json.dumps(d)

In [13]:
a

'{"a": [1, 2, 3], "b": ["satish", "shivam", "shubham"], "c": [4, 55, 34]}'

In [14]:
type(a)

str

In [15]:
header = ['a', 'b', 'c', 'd']

In [16]:
data = dict(zip(header, []*len(header)))

In [17]:
data

{}

In [19]:
print(list(zip(header, [1]*len(header))))

[('a', 1), ('b', 1), ('c', 1), ('d', 1)]

In [20]:
dict.fromkeys([1, 2, 3, 4])

{1: None, 2: None, 3: None, 4: None}

In [22]:
dict.fromkeys([1, 2, 3, 4], [])

{1: [], 2: [], 3: [], 4: []}

In [23]:
lines = ['Satish,34,84,vimal sadan ', 'Shivam,56,93,vimal sadan ', 'shubham,85,3,vimal sadan ', 'satyendra,85,58,sanskar sadan ', '']

In [27]:
header = ['Name', 'id', 'marks', 'address']

In [35]:
data = dict.fromkeys(header)

In [29]:


for line in lines:						
    fields = line[:-1].split(",")
    if line:
        for i, head in enumerate(header):
            data[head].append(fields[i])

In [36]:
data

{'Name': None, 'id': None, 'marks': None, 'address': None}

In [50]:
from collections import defaultdict

In [51]:
data = defaultdict(list)

In [52]:
data.fromkeys(header)

defaultdict(None, {'Name': None, 'id': None, 'marks': None, 'address': None})

In [53]:
data['Name'] = ['Satish', 'Shivam', 'shubham', 'satyendra']

In [54]:
data['id'] = ['34', '56', '85', '85']

In [55]:
data['marks'] = ['84', '93', '3', '58']

In [56]:
data['address'] =  ['vimal sadan', 'vimal sadan', 'vimal sadan', 'sanskar sadan']

In [57]:
data

defaultdict(list,
            {'Name': ['Satish', 'Shivam', 'shubham', 'satyendra'],
             'id': ['34', '56', '85', '85'],
             'marks': ['84', '93', '3', '58'],
             'address': ['vimal sadan',
              'vimal sadan',
              'vimal sadan',
              'sanskar sadan']})

In [58]:
json.dumps(data)

'{"Name": ["Satish", "Shivam", "shubham", "satyendra"], "id": ["34", "56", "85", "85"], "marks": ["84", "93", "3", "58"], "address": ["vimal sadan", "vimal sadan", "vimal sadan", "sanskar sadan"]}'

In [67]:
import pandas as pd

In [68]:
df = pd.DataFrame(data)

In [69]:
df

        Name  id marks        address
0     Satish  34    84    vimal sadan
1     Shivam  56    93    vimal sadan
2    shubham  85     3    vimal sadan
3  satyendra  85    58  sanskar sadan

In [70]:
df.corr

<bound method DataFrame.corr of         Name  id marks        address
0     Satish  34    84    vimal sadan
1     Shivam  56    93    vimal sadan
2    shubham  85     3    vimal sadan
3  satyendra  85    58  sanskar sadan>

In [71]:
df.corr()

Empty DataFrame
Columns: []
Index: []

In [72]:
print(df.corr())

Empty DataFrame
Columns: []
Index: []

In [73]:
df

        Name  id marks        address
0     Satish  34    84    vimal sadan
1     Shivam  56    93    vimal sadan
2    shubham  85     3    vimal sadan
3  satyendra  85    58  sanskar sadan

In [75]:
import pandas as pd
import numpy as np

rs = np.random.RandomState(0)
# df = pd.DataFrame(rs.rand(10, 10))
corr = df.corr()
corr.style.background_gradient(cmap='coolwarm')

In [76]:
corr

Empty DataFrame
Columns: []
Index: []

In [78]:
df1 = df

In [79]:
from sklearn import preprocessing

for x in df1.columns:
    if df1[x].dtype == 'object':
        lbl = preprocessing.LabelEncoder()
        lbl.fit(list(df1[x].values))
        df1[x] = lbl.transform(list(df1[x].values))

In [80]:
df1

   Name  id  marks  address
0     0   0      2        1
1     1   1      3        1
2     3   2      0        1
3     2   2      1        0

In [82]:
df1.corr()

             Name        id     marks   address
Name     1.000000  0.943880 -0.800000 -0.258199
id       0.943880  1.000000 -0.674200 -0.522233
marks   -0.800000 -0.674200  1.000000  0.258199
address -0.258199 -0.522233  0.258199  1.000000

In [83]:
import pandas as pd
import numpy as np

rs = np.random.RandomState(0)
# df = pd.DataFrame(rs.rand(10, 10))
corr = df1.corr()
corr.style.background_gradient(cmap='coolwarm')

In [93]:
f = pd.read_csv('data.csv')

In [95]:
f

     Name  physics  chemistry  Maths  English  Address
0   Rahul       70         75     80       70  Unknown
1   Rushi       88         89     94       75   Kanpur
2  Shivam       99         95     93       78  Jaunpur
3   Virat       35         35     35       35    Delhi
4  Satish       65         67     16       37  Jaunpur
5   Suraj       78         29     26       45   Mumbai
6  Ashish       34         45     78       29   Mumbai
7    Ajay       78         26     29       58  Jaunpur
8   Manoj       45         63     46       36  Jaunpur

In [96]:
df2 = pd.DataFrame(f)

In [97]:
df2

     Name  physics  chemistry  Maths  English  Address
0   Rahul       70         75     80       70  Unknown
1   Rushi       88         89     94       75   Kanpur
2  Shivam       99         95     93       78  Jaunpur
3   Virat       35         35     35       35    Delhi
4  Satish       65         67     16       37  Jaunpur
5   Suraj       78         29     26       45   Mumbai
6  Ashish       34         45     78       29   Mumbai
7    Ajay       78         26     29       58  Jaunpur
8   Manoj       45         63     46       36  Jaunpur

In [99]:
from sklearn import preprocessing

for x in df2.columns:
    if df2[x].dtype == 'object':
        lbl = preprocessing.LabelEncoder()
        lbl.fit(list(df2[x].values))
        df2[x] = lbl.transform(list(df2[x].values))

In [100]:
df2

   Name  physics  chemistry  Maths  English  Address
0     3       70         75     80       70        4
1     4       88         89     94       75        2
2     6       99         95     93       78        1
3     8       35         35     35       35        0
4     5       65         67     16       37        1
5     7       78         29     26       45        3
6     1       34         45     78       29        3
7     0       78         26     29       58        1
8     2       45         63     46       36        1

In [101]:
df2.corr()

               Name   physics  chemistry     Maths   English   Address
Name       1.000000  0.123980   0.078118 -0.150677  0.016752 -0.245450
physics    0.123980  1.000000   0.472605  0.290321  0.858128  0.109947
chemistry  0.078118  0.472605   1.000000  0.704590  0.629179  0.072629
Maths     -0.150677  0.290321   0.704590  1.000000  0.620019  0.374327
English    0.016752  0.858128   0.629179  0.620019  1.000000  0.190761
Address   -0.245450  0.109947   0.072629  0.374327  0.190761  1.000000

In [102]:
df2

   Name  physics  chemistry  Maths  English  Address
0     3       70         75     80       70        4
1     4       88         89     94       75        2
2     6       99         95     93       78        1
3     8       35         35     35       35        0
4     5       65         67     16       37        1
5     7       78         29     26       45        3
6     1       34         45     78       29        3
7     0       78         26     29       58        1
8     2       45         63     46       36        1

In [108]:
df2.to_json(orient='split')

'{"columns":["Name","physics","chemistry","Maths","English","Address"],"index":[0,1,2,3,4,5,6,7,8],"data":[[3,70,75,80,70,4],[4,88,89,94,75,2],[6,99,95,93,78,1],[8,35,35,35,35,0],[5,65,67,16,37,1],[7,78,29,26,45,3],[1,34,45,78,29,3],[0,78,26,29,58,1],[2,45,63,46,36,1]]}'

In [109]:
js = df2.to_json(orient='table')

In [110]:
js

'{"schema": {"fields":[{"name":"index","type":"integer"},{"name":"Name","type":"integer"},{"name":"physics","type":"integer"},{"name":"chemistry","type":"integer"},{"name":"Maths","type":"integer"},{"name":"English","type":"integer"},{"name":"Address","type":"integer"}],"primaryKey":["index"],"pandas_version":"0.20.0"}, "data": [{"index":0,"Name":3,"physics":70,"chemistry":75,"Maths":80,"English":70,"Address":4},{"index":1,"Name":4,"physics":88,"chemistry":89,"Maths":94,"English":75,"Address":2},{"index":2,"Name":6,"physics":99,"chemistry":95,"Maths":93,"English":78,"Address":1},{"index":3,"Name":8,"physics":35,"chemistry":35,"Maths":35,"English":35,"Address":0},{"index":4,"Name":5,"physics":65,"chemistry":67,"Maths":16,"English":37,"Address":1},{"index":5,"Name":7,"physics":78,"chemistry":29,"Maths":26,"English":45,"Address":3},{"index":6,"Name":1,"physics":34,"chemistry":45,"Maths":78,"English":29,"Address":3},{"index":7,"Name":0,"physics":78,"chemistry":26,"Maths":29,"English":58,"Address":1},{"index":8,"Name":2,"physics":45,"chemistry":63,"Maths":46,"English":36,"Address":1}]}'

In [111]:
js = df2.to_json(orient='records')

In [112]:
js

'[{"Name":3,"physics":70,"chemistry":75,"Maths":80,"English":70,"Address":4},{"Name":4,"physics":88,"chemistry":89,"Maths":94,"English":75,"Address":2},{"Name":6,"physics":99,"chemistry":95,"Maths":93,"English":78,"Address":1},{"Name":8,"physics":35,"chemistry":35,"Maths":35,"English":35,"Address":0},{"Name":5,"physics":65,"chemistry":67,"Maths":16,"English":37,"Address":1},{"Name":7,"physics":78,"chemistry":29,"Maths":26,"English":45,"Address":3},{"Name":1,"physics":34,"chemistry":45,"Maths":78,"English":29,"Address":3},{"Name":0,"physics":78,"chemistry":26,"Maths":29,"English":58,"Address":1},{"Name":2,"physics":45,"chemistry":63,"Maths":46,"English":36,"Address":1}]'

In [ ]:
js = df2.to_json(orient='values')

In [117]:
js

'[{"Name":3,"physics":70,"chemistry":75,"Maths":80,"English":70,"Address":4},{"Name":4,"physics":88,"chemistry":89,"Maths":94,"English":75,"Address":2},{"Name":6,"physics":99,"chemistry":95,"Maths":93,"English":78,"Address":1},{"Name":8,"physics":35,"chemistry":35,"Maths":35,"English":35,"Address":0},{"Name":5,"physics":65,"chemistry":67,"Maths":16,"English":37,"Address":1},{"Name":7,"physics":78,"chemistry":29,"Maths":26,"English":45,"Address":3},{"Name":1,"physics":34,"chemistry":45,"Maths":78,"English":29,"Address":3},{"Name":0,"physics":78,"chemistry":26,"Maths":29,"English":58,"Address":1},{"Name":2,"physics":45,"chemistry":63,"Maths":46,"English":36,"Address":1}]'

In [113]:
a = df2.corr()

In [114]:
a

               Name   physics  chemistry     Maths   English   Address
Name       1.000000  0.123980   0.078118 -0.150677  0.016752 -0.245450
physics    0.123980  1.000000   0.472605  0.290321  0.858128  0.109947
chemistry  0.078118  0.472605   1.000000  0.704590  0.629179  0.072629
Maths     -0.150677  0.290321   0.704590  1.000000  0.620019  0.374327
English    0.016752  0.858128   0.629179  0.620019  1.000000  0.190761
Address   -0.245450  0.109947   0.072629  0.374327  0.190761  1.000000

In [115]:
type(a)

pandas.core.frame.DataFrame

In [116]:
a.to_dict()

{'Name': {'Name': 1.0,
  'physics': 0.12397988163526504,
  'chemistry': 0.07811772366720385,
  'Maths': -0.15067713553712772,
  'English': 0.016751717423966205,
  'Address': -0.24545040566139686},
 'physics': {'Name': 0.12397988163526504,
  'physics': 1.0,
  'chemistry': 0.47260505112157175,
  'Maths': 0.2903209697758351,
  'English': 0.8581280919924756,
  'Address': 0.1099469089290013},
 'chemistry': {'Name': 0.07811772366720385,
  'physics': 0.47260505112157175,
  'chemistry': 1.0,
  'Maths': 0.7045897486862586,
  'English': 0.6291789135030855,
  'Address': 0.07262889001310636},
 'Maths': {'Name': -0.15067713553712772,
  'physics': 0.2903209697758351,
  'chemistry': 0.7045897486862586,
  'Maths': 1.0,
  'English': 0.620019082739883,
  'Address': 0.3743267994488332},
 'English': {'Name': 0.016751717423966205,
  'physics': 0.8581280919924756,
  'chemistry': 0.6291789135030855,
  'Maths': 0.620019082739883,
  'English': 1.0,
  'Address': 0.19076123816299587},
 'Address': {'Name': -0.24545040566139686,
  'physics': 0.1099469089290013,
  'chemistry': 0.07262889001310636,
  'Maths': 0.3743267994488332,
  'English': 0.19076123816299587,
  'Address': 1.0}}